_Rarzrabotki/Rarus/USO2/Reports/СМ_ОтчетМ19.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>СМ_ОтчетМ19</Name>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ОбеспечениеРесурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ОбеспечениеРесурса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подрядчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыЗначенийЛимитированныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыЗначенийЛимитированныхЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коэффициент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индекс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВариантыОтклоненияНормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВариантыОтклоненияНормы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Экономия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующийПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/СМ_ОтчетМ19/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Формирует табличный документ отчета (используется для печати из форм списков и элементов).
//
// Параметры:
//	   МассивАктВыполненныхРабот    - Массив - массив ссылок на акты выполненных работ.
//	   ДокументРезультат  			- ТабличныйДокумент - табличный документ для вывода данных.
//	   ЛимзатратаНДС				- СправочникСсылка.СМ_ЛимитированныеЗатраты - ссылка на лимитированную затрату.
//	   ИсключатьМатериалыЗаказчика  - Булево - признак включать ли материалы заказчика в табличный документ или нет.
//	   ВыводитьДоговор              - Булево - признак выводить ли договор в табличный документ или нет.
//	   ВыводитьПодрядчика           - Булево - признак выводить ли подрядчика в табличный документ или нет.
//	   ДопРеквизитКод 				- Строка - содержит значение дополнительного реквизита Код.
//	   ДопРеквизитНаименование 		- Строка - содержит значение дополнительного реквизита Наименование. 
//	   ВыводитьПодписи 				- Булево - признак выводить ли подписи в табличный документ или нет.
//
// Возвращаемое значение:
//     ТабличныйДокумент - результат формирования отчета с заданными параметрами.
//
Процедура ПолучитьЗаполненныйОтчет(МассивАктВыполненныхРабот,ДокументРезультат, ЛимзатратаНДС = Неопределено,ИсключатьМатериалыЗаказчика = Ложь,ВыводитьДоговор = Ложь,ВыводитьПодрядчика = Ложь,ДопРеквизитКод = Неопределено,ДопРеквизитНаименование = Неопределено, ВыводитьПодписи = Ложь) Экспорт
	
	Разделять = Ложь;
	
	Если ТипЗнч(МассивАктВыполненныхРабот) <> Тип("Массив") Тогда
		ТекМассивАктов = Новый Массив;
		ТекМассивАктов.Добавить(МассивАктВыполненныхРабот);
		МассивАктВыполненныхРабот = ТекМассивАктов;	
	КонецЕсли;
	
	Для Каждого АктВыполненныхРабот Из МассивАктВыполненныхРабот Цикл
		
		ТаблицаРесурсовПолная	= СМ_СметаРасчетВызовСервера.ПолучитьТаблицуСтоимостиРесурсовАкта(АктВыполненныхРабот, Истина,,,Истина, Истина,,ИсключатьМатериалыЗаказчика,Истина);
		ТаблицаРесурсов 		= ТаблицаРесурсовПолная.Скопировать(ТаблицаРесурсовПолная.НайтиСтроки(Новый Структура("ВидРесурса",Перечисления.СМ_ВидыРесурсов.Материалы)));
		
		ПараметрыЧисла = Новый КвалификаторыЧисла(15, 6);
		Число15_6 = Новый ОписаниеТипов("Число", , ПараметрыЧисла);
		ТаблицаРесурсов.Колонки.Добавить("Разница", Число15_6);
		
		Если ИсключатьМатериалыЗаказчика Тогда
			МассивСтрок = ТаблицаРесурсов.НайтиСтроки(Новый Структура("СтатусРесурса",Перечисления.СМ_ОбеспечениеРесурса.Подрядчика));
			Для Каждого стр Из МассивСтрок Цикл
				ТаблицаРесурсов.Удалить(стр);
			КонецЦикла;
		КонецЕсли;
		
		СписокСтрокДляУдаления = Новый СписокЗначений();
		
		Если ЗначениеЗаполнено(ЛимзатратаНДС) Тогда
			КоррекцияНДС = 1 + ?(ЛимзатратаНДС.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент, ЛимзатратаНДС.ЗначениеЗатратыПоУмолчанию/100, 0);
		Иначе
			КоррекцияНДС = 1;
		КонецЕсли;
		
		Для Каждого стр Из ТаблицаРесурсов Цикл
			Если стр.РасходПоФакту=0
				И Не стр.ВариантОтклонения = Перечисления.СМ_ВариантыОтклоненияНормы.СледующийПериод Тогда
				СписокСтрокДляУдаления.Добавить(стр);
			ИначеЕсли стр.ВариантОтклонения = Перечисления.СМ_ВариантыОтклоненияНормы.СледующийПериод Тогда 
				стр.Разница = стр.РасходПоНорме - стр.РасходПоФакту;
			КонецЕсли;
			стр.ЦенаТекущая = Окр(стр.ЦенаТекущая * КоррекцияНДС, 2, РежимОкругления.Окр15как20);
			стр.СтоимостьТекущая = Окр(стр.СтоимостьТекущая * КоррекцияНДС, 2, РежимОкругления.Окр15как20);
		КонецЦикла;
		
		Для Каждого стр Из СписокСтрокДляУдаления Цикл
			ТаблицаРесурсов.Удалить(стр.Значение);
		КонецЦикла;   
		
		ТаблицаРесурсов.Колонки.Добавить("НаименованиеWS");
		ТаблицаРесурсов.Колонки.Добавить("КодРесурсаWS");

		ОбрабатыватьWS = Истина;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
			
			ТаблицаДопов = Новый ТаблицаЗначений;
			
			Если ЗначениеЗаполнено(ДопРеквизитКод) И ЗначениеЗаполнено(ДопРеквизитНаименование) Тогда
				ОбрабатыватьWS = Ложь;
				ТаблицаДопов = ПолучитьДопРеквизитыРесурсов(ТаблицаРесурсов.ВыгрузитьКолонку("Ресурс"),ДопРеквизитКод,ДопРеквизитНаименование);
			ИначеЕсли ЗначениеЗаполнено(ДопРеквизитКод) ИЛИ ЗначениеЗаполнено(ДопРеквизитНаименование) Тогда
				ТаблицаДопов = ПолучитьДопРеквизитыРесурсов(ТаблицаРесурсов.ВыгрузитьКолонку("Ресурс"),ДопРеквизитКод,ДопРеквизитНаименование);
			КонецЕсли;
			
			Для Каждого Доп Из ТаблицаДопов Цикл
				СтрокаДанных = ТаблицаРесурсов.Найти(Доп.Ресурс);
				Если Не СтрокаДанных = Неопределено Тогда
					СтрокаДанных.НаименованиеWS = Доп.ДопНаименование;
					СтрокаДанных.КодРесурсаWS = Доп.ДопКод;
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("СМ_WS_ИспользоватьИнтеграцию") И ОбрабатыватьWS Тогда
			ТаблицаWS = Документы.СМ_АктВыполненныхРабот.ПолучитьОстаткиРесурсов(АктВыполненныхРабот);
			
			Для Каждого WS Из ТаблицаWS Цикл
				СтрокаДанных = ТаблицаРесурсов.Найти(WS.Ресурс);
				Если Не СтрокаДанных = Неопределено Тогда
					Если Не ЗначениеЗаполнено(ДопРеквизитНаименование) Тогда
						СтрокаДанных.НаименованиеWS = WS.Наименование;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(ДопРеквизитКод) Тогда
						СтрокаДанных.КодРесурсаWS = WS.Код;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		// ДокументРезультат.Очистить();
		
		Если Разделять Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		Разделять = Истина;
		
		ИД = ЗаполнитьПользовательскиеНастройкиОтчета(Новый Структура("Ссылка",АктВыполненныхРабот));
		
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьДоговор",ВыводитьДоговор);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьПодрядчика",ВыводитьПодрядчика);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьПодписи",ВыводитьПодписи);
		
		ТаблицаПодписей = АктВыполненныхРабот.Подписи.Выгрузить();
		
		ВнешниеНаборыДанных	= Новый Структура;
		ВнешниеНаборыДанных.Вставить("Ресурсы", ТаблицаРесурсов);
		ВнешниеНаборыДанных.Вставить("Подписи", ТаблицаПодписей);
		
		ДанныеРасшифровки 	= Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
		КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
		МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки, ДанныеРасшифровки);
		
		// Скомпонуем результат
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
		
		// Выводим результат в табличный документ
		ПроцессорВывода		= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДопРеквизитыРесурсов(Ресурсы,ДопРеквизитКод,ДопРеквизитНаименование)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_Ресурсы.Ссылка КАК Ресурс,
	               |	ЕСТЬNULL(ДопКод.Значение, """") КАК ДопКод,
	               |	ЕСТЬNULL(ДопНаименование.Значение, """") КАК ДопНаименование
	               |ИЗ
	               |	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СМ_Ресурсы.ДополнительныеРеквизиты КАК ДопКод
	               |		ПО СМ_Ресурсы.Ссылка = ДопКод.Ссылка
	               |			И (ДопКод.Свойство = &СвойствоКод)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СМ_Ресурсы.ДополнительныеРеквизиты КАК ДопНаименование
	               |		ПО (ДопНаименование.Свойство = &СвойствоНаименование)
	               |			И СМ_Ресурсы.Ссылка = ДопНаименование.Ссылка
	               |ГДЕ
	               |	СМ_Ресурсы.Ссылка В(&СписокРесурсов)";
	Запрос.УстановитьПараметр("СписокРесурсов",Ресурсы);
	Запрос.УстановитьПараметр("СвойствоКод",ДопРеквизитКод);
	Запрос.УстановитьПараметр("СвойствоНаименование",ДопРеквизитНаименование);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции 

Функция ЗаполнитьПользовательскиеНастройкиОтчета(ПараметрыПользователя)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Для каждого ПараметрПользователя Из ПараметрыПользователя Цикл
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПользователя.Ключ, ПараметрПользователя.Значение);
	КонецЦикла;
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	Возврат Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Ссылка")).ИдентификаторПользовательскойНастройки;
	
КонецФункции 

#КонецОбласти
